# Russian language
class Texts_Russian:
    
    hello_text_part_one = (
        'Привет, '
    )

    hello_text_part_two = (
        '\nСпасибо, что выбираешь нас! ❤️'
    )

    start_text = (
        '🔐 Добро пожаловать в наш VPN-сервис!\n'
        '\nГотовы обеспечить твою анонимность и безопасность в интернете — быстро, удобно и надёжно.\n'
        '\n💡 Что ты получаешь:\n'
        '\n— Безлимитный трафик — никаких ограничений\n'
        '— Высокую скорость — стабильное соединение в любое время\n'
        '— Доступ с любых устройств — телефон, планшет или ПК\n'
        '\n🛡️ Все подключения проходят сквозное шифрование, так что ты можешь спокойно пользоваться интернетом, зная, что твои данные под надёжной защитой.\n'
        '\n────────────────\n'
        '🎁 Получи 3 дня бесплатного доступа, чтобы оценить все фишки VPN.\n'
        '⚙️ Установка за 2 минуты. Дальше — только комфорт.\n'
        '────────────────'
    )

    keyboard_start_text = (
        'Получить тестовый ключ на 3 дня! 🔐'
    )

    keyboard_menu_text = (
        'Главное меню ➡️'
    )

    give_key_text = (
        'Отлично, для того, чтобы тебе получить бесплатный ключ необходимо подписаться в группу!'
    )
    menu_text = (
        '#картинка\n'
        '\n   🛡️ VPN 🛡️\n'
        'Пользуясь этим VPN ты должен понимать, что он:\n'
        '— Не хранит логов\n'
        '— Обеспечит безопасность, анонимность\n'
        '— Безлимитный трафик\n'
        '— Высокую скорость соединения\n'
        '— Удобен в использовании на всех устройствах\n'
        '\nПодключайся. Исчезай.\n'
        '\n────────────────\n'
        '🎁 Получи 3 дня бесплатного доступа, чтобы оценить все фишки VPN.\n'
        '⚙️ Установка за 2 минуты. Дальше — только комфорт.\n'
        '────────────────\n'
        '\nДля взаимойдствения с ботом используй клавиатуру снизу ⤵️'
    )

    menu_keyboard_personal_account = (
        '💻 Личный кабинет' # после входа в это пишет Manage your subscription, view your balance, and access your settings. и отправляет инлайн кнопки
    )

    menu_keyboard_buy = (
        '💳 Продлить подписку'
    )

    menu_keyboard_info = (
        '⚙️ Как настроить?'
    )

    menu_keyboard_change_location = (
        '🌐 Изменить локацию'
    )

    menu_keyboard_support = (
        '⁉️ Поддержка' # вот поддержка, не стеснйясй писатьб
    )

    menu_keyboard_about = (
        'ℹ️ Все о VPN'
    )

    menu_keyboard_key = (
        '🔐 Мои ключи'
    )

    personal_account_text = (
        '💻 Личный кабинет\n' \
        '\n Ваш бонусный счет: * дней\n'
        ''
    )

    buy_text = (
        'продлить подписку'
    )

    buy_text_inline_1 = (
        '💳1 месяц - 99 ₽'
    )

    buy_text_inline_2 = (
        '💳2 месяца 198 ₽'
    )

    buy_text_inline_3 = (
        '💳3  месяца 297 ₽'
    )

    buy_text_inline_4 = (
        '💳6  месяцев 594 ₽'
    )

    buy_text_inline_5 = (
        '💳1 год  1,188 ₽'
    )

    buy_text_inline_6 = (
        '💳НАВСЕГДА 2,376 ₽'
    )

    inline_text_back = (
        '⬅️Назад'
    )

    support_text_part_one = (
        'Появились вопросы или трудности?\n'
        '\n'
    )

    support_text_part_two = (
        'Не стесняйся обращаться по любому вопросу к специалисту поддержки: @username\n'
        '\n'
        'Также можете писать свои идеи и предложения! Будем рады выслушать тебя.'
    )

    get_info_text = (
        'Куда будем подключать VPN?'
    )

    about_text = (
        'пам парам это впн'
    )

    personal_account_inline_bonuses = (
        'Бонусный счет 🎁'
    )

    inline_close = (
        'Закрыть ❌'
    )

    my_keys_settings_inline = (
        'vpn1_temporary'
    )

    add_new_vpn_inline = (
        'Добавить новый VPN-ключ 🌐'
    )

    inline_go_back = (
        'Назад ⬅️'
    )

    get_all_my_keys = (
        'Вот все твои ключи, нажми на нужный тебе и настрой его ⤵️'
    )

    my_keys_settings_temporary = (
        'Название: vpn1_temporary\n'
        'Местоположение: your_mum_house'
    )                                                               

    my_keys_change_name = (
        'Изменить название'
    )

    my_keys_change_location = (
        'Изменить местоположение'
    )

    message_change_location_key_choose = (
        'Выбери ключ, у которого нужно изменить локацию'
    )

    message_change_location_country_choose = (
        'Твоя текущая локация: *\n'
        '\nВыбери новую локацию из списка ниже ⤵️'
    )

    inline_location_temporary = (
        'location1'
    )

    message_change_location_complete = (
        'Твоя локация была изменена на location'
    )